{
  "data": {
    "title": "v0.4 Alfa",
    "desc": "<h1>Salio una nueva actualizacion de Magirenko Music!</h1> <h2>Actualizacion Grande</h2> <h3>Adiciones</h3> <ul> <li>Una de las actualizaciones mas esperadas: Playlists!<ul> <li>Puedes crear playlists en el menu de archivo &gt; playlists &gt; nueva playlist</li> <li>Puedes abrir playlists en el menu de archivo &gt; playlists &gt; abrir playlist</li> <li>Puedes importar una playlist a la carpeta de musics en el menu de archivo &gt; playlists &gt; importar playlists.</li> <li>Ahora hay un nuevo formato y extension de archivo para las playlists! (una de las cosas mas impresionantes que Magirenko ha hecho)</li> <li>Las playlists tienen un titulo, autor y descripcion.</li> <li>Puedes abrir un archivo .MMPL con Magirenko Music v0.4 para abrirlo desde la extension.</li> <li>Hay 2 ventanas nuevas de la creacion de playlist y informacion de una playlist.</li> <li>Libreria de clases de WPF para manipular playlists, se puede encontrar en los binarios de Magirenko Music v0.4.</li> </ul> </li> <li>adelantamiento de tiempo de musica<ul> <li>Arrastra la linea de tiempo de la musica para cambiar su posicion.</li> <li>Puedes presionar las teclas de las flechas izquierda y derecha para adelantar o atrasar la posicion de la musica.</li> </ul> </li> <li>Menu de archivo<ul> <li>ahora existe un menu de archivo para hacer varias acciones:<ul> <li>Abrir musicas</li> <li>Importar musicas</li> <li>Abrir playlists</li> <li>Importar playlists</li> <li>Crear Playlists</li> </ul> </li> </ul> </li> <li>Se añadio mas manejo de errores (los mensajes que aparecen cuando hay un error desconocido)</li> <li>Se añadio un boton para cambiar la vista de Musicas o playlists</li> <li>Se añadio un boton de recargar las listas.</li> </ul> <h3>Cambios</h3> <ul> <li>Se cambio la linea de tiempo de la reproduccion de musica para que se pueda cambiar la posicion</li> <li>Ya no hay redirecciones de url en la lista de cambios por la deteccion de antivirus</li> <li>ahora el nombre del ejecutable y del DLL se llaman &quot;magirenko_music&quot;</li> <li>ahora en el texto de la version aparece la etapa de Magirenko Music (alfa)</li> <li>Se eliminaron mas referencias de MagicM en el codigo fuente.</li> </ul> <h3>Arreglo de bugs</h3> <ul> <li>Se arreglo el bug que cuando se abre un archivo con formato o extension incompatible, Magirenko Music sigue abierto y se reproduce una musica desconocida.</li> </ul> <h1>Hay bugs graves en Magirenko Music v0.4.</h1> <ul> <li>cuando se abre una playlist desde el explorador de archivos, aparecen todas las pantallas de una.</li> <li>desde la version v0.1 Magirenko Music crasheaba cuando se cierra, esto no se ha notado, ya que la version v0.4 carga temporales de las playlists y se supone que lo elimina cuando se cierra, ya no puede detectar que la aplicacion se cerro por que se cierra con bugs, entonces se acumulan los archivos temporales sin limpiar (tienen los tamaños de los tamaños de las musicas de las playlists), le recomendamos que no cierre Magirenko Music cuando una playlist esta abierta</li> <li>Vamos a solucionar estos dos bugs lo mas rapido que podamos, nos disculpamos por las molestias.</li> </ul>",
    "creationdate": "8/12/24",
    "filename": "magirenko_music_x86",
    "platforms": [
      {
        "type": "Windows",
        "config": {
          "zip": false,
          "rar": true,
          "sevenzip": true,
          "installer": false
        }
      }
    ]
  }
}
